app/views/reservations/availability.html.erb

SELECT "dresses".* FROM "dresses"
---
	  				<%= label_tag "Dress" %><br />
	  				<%= select_tag "dress_id", options_from_collection_for_select(Dress.all, :id, :name), class: "form-control" %>