app/controllers/reservations_controller.rb

SELECT "dress_sizes".* FROM "dress_sizes" WHERE "dress_sizes"."id" IN (1)
SELECT "reservations".* FROM "reservations"
---
  def index
  	@reservations = Reservation.includes(:dress_size).all

SELECT  "dresses".* FROM "dresses"  ORDER BY "dresses"."id" ASC LIMIT 1
SELECT "dress_sizes".* FROM "dress_sizes" WHERE "dress_sizes"."dress_id" = $1  [["dress_id", 1]]
---
  def new
  	@reservation = Reservation.new
  	@dress_sizes = Dress.first.dress_sizes

INSERT INTO "reservations" ("delivery_on", "dress_size_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["delivery_on", "2016-10-17"], ["dress_size_id", 1], ["created_at", "2016-10-17 07:01:21.447714"], ["updated_at", "2016-10-17 07:01:21.447714"]]
SELECT  "dress_sizes".* FROM "dress_sizes" WHERE "dress_sizes"."dress_id" = $1 AND "dress_sizes"."size" = $2 LIMIT 1  [["dress_id", 1], ["size", 1]]
---
  def create
  	if @dress_size.present?
  		date = Date.parse("#{params['reservation']['delivery_on(1i)']}-#{params['reservation']['delivery_on(2i)']}-#{params['reservation']['delivery_on(3i)']}")
  		date = change_if_weekend_date(date)
  		if can_make_reservation?(@dress_size, date)
  			@dress_size.reservations.build(delivery_on: date).save
  			flash[:success] = "Reservation Successfull."
  			redirect_to root_path
  		else
  			@reservation = Reservation.new
  			@dress_sizes = Dress.first.dress_sizes

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def load_sizes
  	dress = Dress.find(params[:value])

SELECT  "dresses".* FROM "dresses"  ORDER BY "dresses"."id" ASC LIMIT 1
SELECT "dress_sizes".* FROM "dress_sizes" WHERE "dress_sizes"."dress_id" = $1  [["dress_id", 1]]
---
  def availability
		@dress_sizes = Dress.first.dress_sizes

SELECT  "dress_sizes".* FROM "dress_sizes" WHERE "dress_sizes"."dress_id" = $1 AND "dress_sizes"."size" = $2 LIMIT 1  [["dress_id", 1], ["size", 1]]
---
  def set_dress_size
  	@dress_size = DressSize.find_by(dress_id: params[:dress_id], size: params[:dress_size])